flange-build/flange/components/packages/tab5-all-in-one/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
# M5Stack Tab5 实测装的是 ESP32-P4 rev v1.0（esptool 报 "revision v1.0"），
# 而 IDF v6.0 默认最低支持 v3.1(CONFIG_ESP32P4_REV_MIN_301)，会在烧录时报
# "requires chip revision in range [v3.1 - v3.99]" 拒绝启动。
#
# ⚠️ 这两档是**互斥**的，不能运行时兼容。IDF Kconfig 原文：
#   "Support of ESP32-P4 rev. <3.0 and >=3.0 is mutually exclusive"
#   "Revisions higher than 3.0 (included) and revisions less than 3.0
#    have huge hardware difference."
# 即本固件编译为支持 v0.x/v1.x 后，就跑不了 v3.x 的 P4。若日后遇到换了
# v3.x 芯片的 Tab5 批次，需要另出一份固件，无法像双面板那样运行时探测。
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
# Tab5 的 UART0(G37/G38) 引到 M5-Bus，不与显示/音频争引脚，保留完整串口控制台
# （与 Cardputer 的 CONFIG_ESP_CONSOLE_NONE 相反）。
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# ⚠️ 必须同时关掉次级控制台与 USJ 模块，否则 USB-C 上枚举出来的是 CDC ACM 而非 GUD。
# P4 只有一条 FS/LS PHY(SOC_USB_FSLS_PHY_NUM=1)，USB-Serial/JTAG 与 OTG1.1 共用它。
# IDF 的 ESP_CONSOLE_SECONDARY 默认就是 USB_SERIAL_JTAG，它 select 出
# ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED → USJ_ENABLE_USB_SERIAL_JTAG，
# 于是 USJ 外设开机即占住 PHY，TinyUSB 再怎么 usb_new_phy() 也抢不过来 ——
# 主机侧表现为 `cdc_acm ... ttyACM0: USB ACM device`，完全看不到 16d0:10a9。
# 只指定主控制台走 UART0 是不够的，次级那条是独立选项。
# 注：这两项只影响**应用**阶段；bootloader 阶段 USJ 仍启用，按 BOOT 进下载模式照常能烧。
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=n
# TinyUSB vendor 类：esp_tinyusb 用 *_COUNT(int) 启用，>0 即开启 CFG_TUD_VENDOR
CONFIG_TINYUSB_VENDOR_COUNT=1
# TinyUSB HID 接口：>0 即开启 CFG_TUD_HID
CONFIG_TINYUSB_HID_COUNT=1
# 32MB HEX(16 线) PSRAM：DPI 帧缓冲(1.84MB) + GUD 收帧缓冲都放这里
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
# esp_codec_dev 默认把十几颗 codec 全编进来。Tab5 只用 ES8388(播放) 与
# ES7210(录音)，其余全关 —— 省 flash，也让「哪颗芯片在起作用」在配置里一目了然。
# （ZL38063 / CJC8910 / DUMMY / DATA_ADC 组件自身就默认 n，不必重复关。）
CONFIG_CODEC_ES8311_SUPPORT=n
CONFIG_CODEC_ES8156_SUPPORT=n
CONFIG_CODEC_ES8374_SUPPORT=n
CONFIG_CODEC_ES8389_SUPPORT=n
CONFIG_CODEC_ES7243_SUPPORT=n
CONFIG_CODEC_ES7243E_SUPPORT=n
CONFIG_CODEC_AW88298_SUPPORT=n
CONFIG_CODEC_TAS5805M_SUPPORT=n
# ── 调试用 USB CDC 串口 ───────────────────────────────────────────
# **别在这里手动开 CONFIG_TINYUSB_CDC_ENABLED**（usb_descriptors.h 有 #error 拦着）：
# esp_tinyusb 默认给 CDC 的端点是 0x83/0x84，与 UAC 录音、UVC 预留直接撞号，
# 而且 2 条 IN 端点会把 P4 全速控制器的 4 条可用 IN 用超。
#
# 要日志请开 menuconfig → Tab5 All-in-One → CONFIG_AIO_DEBUG_CDC：
# 它让出 GUD 的 IN 端点（drm/gud 不用它）、借用 UVC 预留的 0x84，把端点号重排到
# 刚好装得下，并自动 select 出 CONFIG_TINYUSB_CDC_ENABLED。见 main/Kconfig.projbuild。
#
#     idf.py menuconfig   # 打开 CONFIG_AIO_DEBUG_CDC
#     idf.py build flash monitor
#
# 也可以接 UART0(G37/G38，在 M5-Bus 排针上)，那条能抓到上电最早的日志。
